app/views/index/_post.html.erb

	<small>
		<% p.tags.each do |t| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."post_id" = ?  [["post_id", 1]]

		<div class="pull-right blog-post-meta">
			<%= p.created_at %> <a href="/about/<%= p.author.username %>"><%= p.author.first_name %> <%= p.author.last_name %></a>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? ORDER BY "authors"."id" ASC LIMIT 1  [["id", 1]]