app/views/post/index.html.erb

SELECT "tags".* FROM "tags" WHERE "tags"."post_id" = ?  [["post_id", 10]]
---
		<small>
			<% @post.tags.each do |t| %>

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? ORDER BY "authors"."id" ASC LIMIT 1  [["id", 1]]
---
			<div class="pull-right blog-post-meta">
				<%= @post.created_at %> <a href="/about/<%= @post.author.username %>"><%= @post.author.first_name %> <%= @post.author.last_name %></a>