app/controllers/category_controller.rb

	def index
		category = Category.where("category_slug='#{params[:slug]}'").first
---
SELECT "categories".* FROM "categories" WHERE (category_slug='a-category') ORDER BY "categories"."id" ASC LIMIT 1