app/controllers/index_controller.rb

SELECT "posts".* FROM "posts" ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
	def index
		@posts = Post.all.order("id DESC").page(params[:page]).per(5)