app/controllers/post_controller.rb

SELECT "posts".* FROM "posts" WHERE (post_slug='test-post-9') ORDER BY "posts"."id" ASC LIMIT 1
---
	def index
		@post = Post.where("post_slug='#{params[:slug]}'").first